sprint-1/results/steady-load-output-20250714_001432.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: steady-load.js
        output: json (../results/steady-load-results-20250714_001432.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m01.0s/3m00.0s

running (0m02.0s), 04/50 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 04/50 VUs  0m02.0s/3m00.0s

running (0m03.0s), 05/50 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  0m03.0s/3m00.0s

running (0m04.0s), 07/50 VUs, 11 complete and 0 interrupted iterations
default   [   2% ] 07/50 VUs  0m04.0s/3m00.0s

running (0m05.0s), 09/50 VUs, 18 complete and 0 interrupted iterations
default   [   3% ] 09/50 VUs  0m05.0s/3m00.0s

running (0m06.0s), 10/50 VUs, 27 complete and 0 interrupted iterations
default   [   3% ] 10/50 VUs  0m06.0s/3m00.0s

running (0m07.0s), 12/50 VUs, 37 complete and 0 interrupted iterations
default   [   4% ] 12/50 VUs  0m07.0s/3m00.0s

running (0m08.0s), 14/50 VUs, 49 complete and 0 interrupted iterations
default   [   4% ] 14/50 VUs  0m08.0s/3m00.0s

running (0m09.0s), 15/50 VUs, 63 complete and 0 interrupted iterations
default   [   5% ] 15/50 VUs  0m09.0s/3m00.0s

running (0m10.0s), 17/50 VUs, 78 complete and 0 interrupted iterations
default   [   6% ] 17/50 VUs  0m10.0s/3m00.0s

running (0m11.0s), 18/50 VUs, 95 complete and 0 interrupted iterations
default   [   6% ] 18/50 VUs  0m11.0s/3m00.0s

running (0m12.0s), 20/50 VUs, 113 complete and 0 interrupted iterations
default   [   7% ] 20/50 VUs  0m12.0s/3m00.0s

running (0m13.0s), 22/50 VUs, 133 complete and 0 interrupted iterations
default   [   7% ] 22/50 VUs  0m13.0s/3m00.0s

running (0m14.0s), 23/50 VUs, 154 complete and 0 interrupted iterations
default   [   8% ] 23/50 VUs  0m14.0s/3m00.0s

running (0m15.0s), 25/50 VUs, 177 complete and 0 interrupted iterations
default   [   8% ] 25/50 VUs  0m15.0s/3m00.0s

running (0m16.0s), 27/50 VUs, 202 complete and 0 interrupted iterations
default   [   9% ] 27/50 VUs  0m16.0s/3m00.0s

running (0m17.0s), 28/50 VUs, 229 complete and 0 interrupted iterations
default   [   9% ] 28/50 VUs  0m17.0s/3m00.0s

running (0m18.0s), 30/50 VUs, 257 complete and 0 interrupted iterations
default   [  10% ] 30/50 VUs  0m18.0s/3m00.0s

running (0m19.0s), 32/50 VUs, 287 complete and 0 interrupted iterations
default   [  11% ] 32/50 VUs  0m19.0s/3m00.0s

running (0m20.0s), 33/50 VUs, 316 complete and 0 interrupted iterations
default   [  11% ] 33/50 VUs  0m20.0s/3m00.0s

running (0m21.0s), 35/50 VUs, 350 complete and 0 interrupted iterations
default   [  12% ] 35/50 VUs  0m21.0s/3m00.0s

running (0m22.0s), 36/50 VUs, 384 complete and 0 interrupted iterations
default   [  12% ] 36/50 VUs  0m22.0s/3m00.0s

running (0m23.0s), 38/50 VUs, 420 complete and 0 interrupted iterations
default   [  13% ] 38/50 VUs  0m23.0s/3m00.0s

running (0m24.0s), 40/50 VUs, 458 complete and 0 interrupted iterations
default   [  13% ] 40/50 VUs  0m24.0s/3m00.0s

running (0m25.0s), 41/50 VUs, 498 complete and 0 interrupted iterations
default   [  14% ] 41/50 VUs  0m25.0s/3m00.0s

running (0m26.0s), 43/50 VUs, 539 complete and 0 interrupted iterations
default   [  14% ] 43/50 VUs  0m26.0s/3m00.0s

running (0m27.0s), 45/50 VUs, 582 complete and 0 interrupted iterations
default   [  15% ] 45/50 VUs  0m27.0s/3m00.0s

running (0m28.0s), 46/50 VUs, 625 complete and 0 interrupted iterations
default   [  16% ] 46/50 VUs  0m28.0s/3m00.0s

running (0m29.0s), 48/50 VUs, 671 complete and 0 interrupted iterations
default   [  16% ] 48/50 VUs  0m29.0s/3m00.0s

running (0m30.0s), 49/50 VUs, 719 complete and 0 interrupted iterations
default   [  17% ] 49/50 VUs  0m30.0s/3m00.0s

running (0m31.0s), 50/50 VUs, 768 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m31.0s/3m00.0s

running (0m32.0s), 50/50 VUs, 818 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m32.0s/3m00.0s

running (0m33.0s), 50/50 VUs, 868 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m33.0s/3m00.0s

running (0m34.0s), 50/50 VUs, 918 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m34.0s/3m00.0s

running (0m35.0s), 50/50 VUs, 968 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m35.0s/3m00.0s

running (0m36.0s), 50/50 VUs, 1018 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  0m36.0s/3m00.0s

running (0m37.0s), 50/50 VUs, 1068 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  0m37.0s/3m00.0s

running (0m38.0s), 50/50 VUs, 1118 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  0m38.0s/3m00.0s

running (0m39.0s), 50/50 VUs, 1168 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  0m39.0s/3m00.0s

running (0m40.0s), 50/50 VUs, 1218 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  0m40.0s/3m00.0s

running (0m41.0s), 50/50 VUs, 1265 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  0m41.0s/3m00.0s

running (0m42.0s), 50/50 VUs, 1315 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  0m42.0s/3m00.0s

running (0m43.0s), 50/50 VUs, 1365 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  0m43.0s/3m00.0s

running (0m44.0s), 50/50 VUs, 1415 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  0m44.0s/3m00.0s

running (0m45.0s), 50/50 VUs, 1460 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  0m45.0s/3m00.0s

running (0m46.0s), 50/50 VUs, 1510 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  0m46.0s/3m00.0s

running (0m47.0s), 50/50 VUs, 1560 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  0m47.0s/3m00.0s

running (0m48.0s), 50/50 VUs, 1610 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  0m48.0s/3m00.0s

running (0m49.0s), 50/50 VUs, 1660 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  0m49.0s/3m00.0s

running (0m50.0s), 50/50 VUs, 1710 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  0m50.0s/3m00.0s

running (0m51.0s), 50/50 VUs, 1758 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  0m51.0s/3m00.0s

running (0m52.0s), 50/50 VUs, 1808 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  0m52.0s/3m00.0s

running (0m53.0s), 50/50 VUs, 1858 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  0m53.0s/3m00.0s

running (0m54.0s), 50/50 VUs, 1908 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  0m54.0s/3m00.0s

running (0m55.0s), 50/50 VUs, 1958 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m55.0s/3m00.0s

running (0m56.0s), 50/50 VUs, 2008 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m56.0s/3m00.0s

running (0m57.0s), 50/50 VUs, 2058 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  0m57.0s/3m00.0s

running (0m58.0s), 50/50 VUs, 2105 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  0m58.0s/3m00.0s

running (0m59.0s), 50/50 VUs, 2155 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m59.0s/3m00.0s

running (1m00.0s), 50/50 VUs, 2205 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m00.0s/3m00.0s

running (1m01.0s), 50/50 VUs, 2255 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m01.0s/3m00.0s

running (1m02.0s), 50/50 VUs, 2305 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m02.0s/3m00.0s

running (1m03.0s), 50/50 VUs, 2355 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m03.0s/3m00.0s

running (1m04.0s), 50/50 VUs, 2405 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m04.0s/3m00.0s

running (1m05.0s), 50/50 VUs, 2455 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m05.0s/3m00.0s

running (1m06.0s), 50/50 VUs, 2505 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m06.0s/3m00.0s

running (1m07.0s), 50/50 VUs, 2550 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m07.0s/3m00.0s

running (1m08.0s), 50/50 VUs, 2600 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m08.0s/3m00.0s

running (1m09.0s), 50/50 VUs, 2650 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m09.0s/3m00.0s

running (1m10.0s), 50/50 VUs, 2700 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m10.0s/3m00.0s

running (1m11.0s), 50/50 VUs, 2750 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m11.0s/3m00.0s

running (1m12.0s), 50/50 VUs, 2800 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m12.0s/3m00.0s

running (1m13.0s), 50/50 VUs, 2850 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m13.0s/3m00.0s

running (1m14.0s), 50/50 VUs, 2887 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m14.0s/3m00.0s

running (1m15.0s), 50/50 VUs, 2935 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  1m15.0s/3m00.0s

running (1m16.0s), 50/50 VUs, 2985 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  1m16.0s/3m00.0s

running (1m17.0s), 50/50 VUs, 3035 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m17.0s/3m00.0s

running (1m18.0s), 50/50 VUs, 3085 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m18.0s/3m00.0s

running (1m19.0s), 50/50 VUs, 3135 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  1m19.0s/3m00.0s

running (1m20.0s), 50/50 VUs, 3185 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  1m20.0s/3m00.0s

running (1m21.0s), 50/50 VUs, 3235 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  1m21.0s/3m00.0s

running (1m22.0s), 50/50 VUs, 3285 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  1m22.0s/3m00.0s

running (1m23.0s), 50/50 VUs, 3335 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  1m23.0s/3m00.0s

running (1m24.0s), 50/50 VUs, 3385 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m24.0s/3m00.0s

running (1m25.0s), 50/50 VUs, 3435 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m25.0s/3m00.0s

running (1m26.0s), 50/50 VUs, 3485 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  1m26.0s/3m00.0s

running (1m27.0s), 50/50 VUs, 3535 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  1m27.0s/3m00.0s

running (1m28.0s), 50/50 VUs, 3585 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m28.0s/3m00.0s

running (1m29.0s), 50/50 VUs, 3635 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m29.0s/3m00.0s

running (1m30.0s), 50/50 VUs, 3685 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  1m30.0s/3m00.0s

running (1m31.0s), 50/50 VUs, 3735 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m31.0s/3m00.0s

running (1m32.0s), 50/50 VUs, 3785 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m32.0s/3m00.0s

running (1m33.0s), 50/50 VUs, 3835 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m33.0s/3m00.0s

running (1m34.0s), 50/50 VUs, 3885 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m34.0s/3m00.0s

running (1m35.0s), 50/50 VUs, 3935 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m35.0s/3m00.0s

running (1m36.0s), 50/50 VUs, 3985 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m36.0s/3m00.0s

running (1m37.0s), 50/50 VUs, 4035 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m37.0s/3m00.0s

running (1m38.0s), 50/50 VUs, 4085 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m38.0s/3m00.0s

running (1m39.0s), 50/50 VUs, 4135 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  1m39.0s/3m00.0s

running (1m40.0s), 50/50 VUs, 4185 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m40.0s/3m00.0s

running (1m41.0s), 50/50 VUs, 4230 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m41.0s/3m00.0s

running (1m42.0s), 50/50 VUs, 4280 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m42.0s/3m00.0s

running (1m43.0s), 50/50 VUs, 4330 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m43.0s/3m00.0s

running (1m44.0s), 50/50 VUs, 4380 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  1m44.0s/3m00.0s

running (1m45.0s), 50/50 VUs, 4430 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  1m45.0s/3m00.0s

running (1m46.0s), 50/50 VUs, 4480 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m46.0s/3m00.0s

running (1m47.0s), 50/50 VUs, 4530 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m47.0s/3m00.0s

running (1m48.0s), 50/50 VUs, 4580 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  1m48.0s/3m00.0s

running (1m49.0s), 50/50 VUs, 4630 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m49.0s/3m00.0s

running (1m50.0s), 50/50 VUs, 4680 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m50.0s/3m00.0s

running (1m51.0s), 50/50 VUs, 4730 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m51.0s/3m00.0s

running (1m52.0s), 50/50 VUs, 4768 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m52.0s/3m00.0s

running (1m53.0s), 50/50 VUs, 4811 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m53.0s/3m00.0s

running (1m54.0s), 50/50 VUs, 4860 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m54.0s/3m00.0s

running (1m55.0s), 50/50 VUs, 4910 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m55.0s/3m00.0s

running (1m56.0s), 50/50 VUs, 4960 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m56.0s/3m00.0s

running (1m57.0s), 50/50 VUs, 5010 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  1m57.0s/3m00.0s

running (1m58.0s), 50/50 VUs, 5060 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m58.0s/3m00.0s

running (1m59.0s), 50/50 VUs, 5110 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m59.0s/3m00.0s

running (2m00.0s), 50/50 VUs, 5160 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m00.0s/3m00.0s

running (2m01.0s), 50/50 VUs, 5210 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m01.0s/3m00.0s

running (2m02.0s), 50/50 VUs, 5260 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m02.0s/3m00.0s

running (2m03.0s), 50/50 VUs, 5310 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m03.0s/3m00.0s

running (2m04.0s), 50/50 VUs, 5360 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m04.0s/3m00.0s

running (2m05.0s), 50/50 VUs, 5410 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m05.0s/3m00.0s

running (2m06.0s), 50/50 VUs, 5460 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  2m06.0s/3m00.0s

running (2m07.0s), 50/50 VUs, 5510 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m07.0s/3m00.0s

running (2m08.0s), 50/50 VUs, 5560 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m08.0s/3m00.0s

running (2m09.0s), 50/50 VUs, 5610 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m09.0s/3m00.0s

running (2m10.0s), 50/50 VUs, 5660 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m10.0s/3m00.0s

running (2m11.0s), 50/50 VUs, 5710 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m11.0s/3m00.0s

running (2m12.0s), 50/50 VUs, 5760 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m12.0s/3m00.0s

running (2m13.0s), 50/50 VUs, 5810 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m13.0s/3m00.0s

running (2m14.0s), 50/50 VUs, 5860 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m14.0s/3m00.0s

running (2m15.0s), 50/50 VUs, 5910 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  2m15.0s/3m00.0s

running (2m16.0s), 50/50 VUs, 5960 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m16.0s/3m00.0s

running (2m17.0s), 50/50 VUs, 6010 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m17.0s/3m00.0s

running (2m18.0s), 50/50 VUs, 6035 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m18.0s/3m00.0s

running (2m19.0s), 50/50 VUs, 6085 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m19.0s/3m00.0s

running (2m20.0s), 50/50 VUs, 6135 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m20.0s/3m00.0s

running (2m21.0s), 50/50 VUs, 6185 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m21.0s/3m00.0s

running (2m22.0s), 50/50 VUs, 6235 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m22.0s/3m00.0s

running (2m23.0s), 50/50 VUs, 6285 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m23.0s/3m00.0s

running (2m24.0s), 50/50 VUs, 6335 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  2m24.0s/3m00.0s

running (2m25.0s), 50/50 VUs, 6385 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m25.0s/3m00.0s

running (2m26.0s), 50/50 VUs, 6435 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m26.0s/3m00.0s

running (2m27.0s), 50/50 VUs, 6485 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m27.0s/3m00.0s

running (2m28.0s), 50/50 VUs, 6535 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m28.0s/3m00.0s

running (2m29.0s), 50/50 VUs, 6585 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m29.0s/3m00.0s

running (2m30.0s), 50/50 VUs, 6635 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m30.0s/3m00.0s

running (2m31.0s), 49/50 VUs, 6685 complete and 0 interrupted iterations
default   [  84% ] 49/50 VUs  2m31.0s/3m00.0s

running (2m32.0s), 49/50 VUs, 6734 complete and 0 interrupted iterations
default   [  84% ] 49/50 VUs  2m32.0s/3m00.0s

running (2m33.0s), 47/50 VUs, 6783 complete and 0 interrupted iterations
default   [  85% ] 47/50 VUs  2m33.0s/3m00.0s

running (2m34.0s), 45/50 VUs, 6830 complete and 0 interrupted iterations
default   [  86% ] 45/50 VUs  2m34.0s/3m00.0s

running (2m35.0s), 44/50 VUs, 6875 complete and 0 interrupted iterations
default   [  86% ] 44/50 VUs  2m35.0s/3m00.0s

running (2m36.0s), 41/50 VUs, 6919 complete and 0 interrupted iterations
default   [  87% ] 41/50 VUs  2m36.0s/3m00.0s

running (2m37.0s), 40/50 VUs, 6960 complete and 0 interrupted iterations
default   [  87% ] 40/50 VUs  2m37.0s/3m00.0s

running (2m38.0s), 38/50 VUs, 7000 complete and 0 interrupted iterations
default   [  88% ] 38/50 VUs  2m38.0s/3m00.0s

running (2m39.0s), 36/50 VUs, 7038 complete and 0 interrupted iterations
default   [  88% ] 36/50 VUs  2m39.0s/3m00.0s

running (2m40.0s), 34/50 VUs, 7074 complete and 0 interrupted iterations
default   [  89% ] 34/50 VUs  2m40.0s/3m00.0s

running (2m41.0s), 33/50 VUs, 7108 complete and 0 interrupted iterations
default   [  89% ] 33/50 VUs  2m41.0s/3m00.0s

running (2m42.0s), 31/50 VUs, 7141 complete and 0 interrupted iterations
default   [  90% ] 31/50 VUs  2m42.0s/3m00.0s

running (2m43.0s), 30/50 VUs, 7172 complete and 0 interrupted iterations
default   [  91% ] 30/50 VUs  2m43.0s/3m00.0s

running (2m44.0s), 28/50 VUs, 7202 complete and 0 interrupted iterations
default   [  91% ] 28/50 VUs  2m44.0s/3m00.0s

running (2m45.0s), 26/50 VUs, 7230 complete and 0 interrupted iterations
default   [  92% ] 26/50 VUs  2m45.0s/3m00.0s

running (2m46.0s), 24/50 VUs, 7256 complete and 0 interrupted iterations
default   [  92% ] 24/50 VUs  2m46.0s/3m00.0s

running (2m47.0s), 23/50 VUs, 7280 complete and 0 interrupted iterations
default   [  93% ] 23/50 VUs  2m47.0s/3m00.0s

running (2m48.0s), 21/50 VUs, 7303 complete and 0 interrupted iterations
default   [  93% ] 21/50 VUs  2m48.0s/3m00.0s

running (2m49.0s), 19/50 VUs, 7324 complete and 0 interrupted iterations
default   [  94% ] 19/50 VUs  2m49.0s/3m00.0s

running (2m50.0s), 18/50 VUs, 7343 complete and 0 interrupted iterations
default   [  94% ] 18/50 VUs  2m50.0s/3m00.0s

running (2m51.0s), 16/50 VUs, 7361 complete and 0 interrupted iterations
default   [  95% ] 16/50 VUs  2m51.0s/3m00.0s

running (2m52.0s), 15/50 VUs, 7377 complete and 0 interrupted iterations
default   [  96% ] 15/50 VUs  2m52.0s/3m00.0s

running (2m53.0s), 13/50 VUs, 7392 complete and 0 interrupted iterations
default   [  96% ] 13/50 VUs  2m53.0s/3m00.0s

running (2m54.0s), 11/50 VUs, 7405 complete and 0 interrupted iterations
default   [  97% ] 11/50 VUs  2m54.0s/3m00.0s

running (2m55.0s), 10/50 VUs, 7416 complete and 0 interrupted iterations
default   [  97% ] 10/50 VUs  2m55.0s/3m00.0s

running (2m56.0s), 08/50 VUs, 7426 complete and 0 interrupted iterations
default   [  98% ] 08/50 VUs  2m56.0s/3m00.0s

running (2m57.0s), 06/50 VUs, 7434 complete and 0 interrupted iterations
default   [  98% ] 06/50 VUs  2m57.0s/3m00.0s

running (2m58.0s), 05/50 VUs, 7440 complete and 0 interrupted iterations
default   [  99% ] 05/50 VUs  2m58.0s/3m00.0s

running (2m59.0s), 03/50 VUs, 7445 complete and 0 interrupted iterations
default   [  99% ] 03/50 VUs  2m59.0s/3m00.0s

running (3m00.0s), 01/50 VUs, 7448 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  3m00.0s/3m00.0s
time="2025-07-14T00:17:38+07:00" level=info msg="\n📊 Steady Load Test Results:" source=console
time="2025-07-14T00:17:38+07:00" level=info msg="============================" source=console
time="2025-07-14T00:17:38+07:00" level=info msg="✅ Test completed successfully" source=console
time="2025-07-14T00:17:38+07:00" level=info msg="📈 Check metrics above for performance analysis" source=console
time="2025-07-14T00:17:38+07:00" level=info msg="🔍 Traffic distribution analysis available in HAProxy stats" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<150' p(95)=23.41ms

      {scenario:default}
      ✓ 'p(99)<300' p(99)=29.33ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%

    http_reqs
    ✗ 'rate>=45' rate=41.176449/s


  █ TOTAL RESULTS 

    checks_total.......................: 22347  123.529346/s
    checks_succeeded...................: 99.99% 22345 out of 22347
    checks_failed......................: 0.00%  2 out of 22347

    ✓ status is 200
    ✗ response time < 150ms
      ↳  99% — ✓ 7447 / ✗ 2
    ✓ response time < 300ms

    CUSTOM
    errors..................................................................: 0.00%  0 out of 7449
    k3s_responses...........................................................: 5959   32.940053/s
    knative_responses.......................................................: 1490   8.236395/s
    response_time...........................................................: avg=11.279714 min=0.498 med=10.243  max=222.858  p(90)=21.0256 p(95)=23.4144

    HTTP
    http_req_duration.......................................................: avg=11.27ms   min=498µs med=10.24ms max=222.85ms p(90)=21.02ms p(95)=23.41ms
      { expected_response:true }............................................: avg=11.27ms   min=498µs med=10.24ms max=222.85ms p(90)=21.02ms p(95)=23.41ms
      { scenario:default }..................................................: avg=11.27ms   min=498µs med=10.24ms max=222.85ms p(90)=21.02ms p(95)=23.41ms
    http_req_failed.........................................................: 0.00%  0 out of 7449
    http_reqs...............................................................: 7449   41.176449/s

    EXECUTION
    iteration_duration......................................................: avg=1.01s     min=1s    med=1.01s   max=1.22s    p(90)=1.02s   p(95)=1.02s  
    iterations..............................................................: 7449   41.176449/s
    vus.....................................................................: 1      min=1         max=50
    vus_max.................................................................: 50     min=50        max=50

    NETWORK
    data_received...........................................................: 3.6 MB 20 kB/s
    data_sent...............................................................: 521 kB 2.9 kB/s



running (3m00.9s), 00/50 VUs, 7449 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  3m0s
time="2025-07-14T00:17:38+07:00" level=error msg="thresholds on metrics 'http_reqs' have been crossed"